zephyrproject-rtos/hal_nuvoton/dts/pinctrl/m031x-pinctrl.h
#define PF14MFP_GPIO NVT_PINMUX('F', 14, SYS_GPF_MFPH_PF14MFP_GPIO)
#define PF14MFP_CLKO NVT_PINMUX('F', 14, SYS_GPF_MFPH_PF14MFP_CLKO)
#define PF14MFP_INT5 NVT_PINMUX('F', 14, SYS_GPF_MFPH_PF14MFP_INT5)
#define PF14MFP_PWM0_BRAKE0 NVT_PINMUX('F', 14, SYS_GPF_MFPH_PF14MFP_PWM0_BRAKE0)
#define PF14MFP_PWM0_CH4 NVT_PINMUX('F', 14, SYS_GPF_MFPH_PF14MFP_PWM0_CH4)
#define PF14MFP_PWM1_BRAKE0 NVT_PINMUX('F', 14, SYS_GPF_MFPH_PF14MFP_PWM1_BRAKE0)
#define PF14MFP_TM3 NVT_PINMUX('F', 14, SYS_GPF_MFPH_PF14MFP_TM3)
#define PF15MFP_GPIO NVT_PINMUX('F', 15, SYS_GPF_MFPH_PF15MFP_GPIO)
#define PF15MFP_CLKO NVT_PINMUX('F', 15, SYS_GPF_MFPH_PF15MFP_CLKO)
#define PF15MFP_INT4 NVT_PINMUX('F', 15, SYS_GPF_MFPH_PF15MFP_INT4)
#define PF15MFP_PWM0_BRAKE0 NVT_PINMUX('F', 15, SYS_GPF_MFPH_PF15MFP_PWM0_BRAKE0)
#define PF15MFP_PWM0_CH1 NVT_PINMUX('F', 15, SYS_GPF_MFPH_PF15MFP_PWM0_CH1)
#define PF15MFP_TM2 NVT_PINMUX('F', 15, SYS_GPF_MFPH_PF15MFP_TM2)
#define PG2MFP_GPIO NVT_PINMUX('G', 2, SYS_GPG_MFPL_PG2MFP_GPIO)
#define PG2MFP_EBI_ADR11 NVT_PINMUX('G', 2, SYS_GPG_MFPL_PG2MFP_EBI_ADR11)
#define PG2MFP_I2C0_SMBAL NVT_PINMUX('G', 2, SYS_GPG_MFPL_PG2MFP_I2C0_SMBAL)
#define PG2MFP_I2C1_SCL NVT_PINMUX('G', 2, SYS_GPG_MFPL_PG2MFP_I2C1_SCL)
#define PG2MFP_TM0 NVT_PINMUX('G', 2, SYS_GPG_MFPL_PG2MFP_TM0)
#define PG3MFP_GPIO NVT_PINMUX('G', 3, SYS_GPG_MFPL_PG3MFP_GPIO)
#define PG3MFP_EBI_ADR12 NVT_PINMUX('G', 3, SYS_GPG_MFPL_PG3MFP_EBI_ADR12)
#define PG3MFP_I2C0_SMBSUS NVT_PINMUX('G', 3, SYS_GPG_MFPL_PG3MFP_I2C0_SMBSUS)
#define PG3MFP_I2C1_SDA NVT_PINMUX('G', 3, SYS_GPG_MFPL_PG3MFP_I2C1_SDA)
#define PG3MFP_TM1 NVT_PINMUX('G', 3, SYS_GPG_MFPL_PG3MFP_TM1)
#define PG4MFP_GPIO NVT_PINMUX('G', 4, SYS_GPG_MFPL_PG4MFP_GPIO)
#define PG4MFP_EBI_ADR13 NVT_PINMUX('G', 4, SYS_GPG_MFPL_PG4MFP_EBI_ADR13)
#define PG4MFP_TM2 NVT_PINMUX('G', 4, SYS_GPG_MFPL_PG4MFP_TM2)
#define PG9MFP_GPIO NVT_PINMUX('G', 9, SYS_GPG_MFPH_PG9MFP_GPIO)
#define PG9MFP_BPWM0_CH5 NVT_PINMUX('G', 9, SYS_GPG_MFPH_PG9MFP_BPWM0_CH5)
#define PG9MFP_EBI_AD0 NVT_PINMUX('G', 9, SYS_GPG_MFPH_PG9MFP_EBI_AD0)
#define PG10MFP_GPIO NVT_PINMUX('G', 10, SYS_GPG_MFPH_PG10MFP_GPIO)
#define PG10MFP_BPWM0_CH4 NVT_PINMUX('G', 10, SYS_GPG_MFPH_PG10MFP_BPWM0_CH4)
#define PG10MFP_EBI_AD1 NVT_PINMUX('G', 10, SYS_GPG_MFPH_PG10MFP_EBI_AD1)
#define PG11MFP_GPIO NVT_PINMUX('G', 11, SYS_GPG_MFPH_PG11MFP_GPIO)
#define PG11MFP_BPWM0_CH3 NVT_PINMUX('G', 11, SYS_GPG_MFPH_PG11MFP_BPWM0_CH3)
#define PG11MFP_EBI_AD2 NVT_PINMUX('G', 11, SYS_GPG_MFPH_PG11MFP_EBI_AD2)
#define PG11MFP_UART7_TXD NVT_PINMUX('G', 11, SYS_GPG_MFPH_PG11MFP_UART7_TXD)
#define PG12MFP_GPIO NVT_PINMUX('G', 12, SYS_GPG_MFPH_PG12MFP_GPIO)
#define PG12MFP_BPWM0_CH2 NVT_PINMUX('G', 12, SYS_GPG_MFPH_PG12MFP_BPWM0_CH2)
#define PG12MFP_EBI_AD3 NVT_PINMUX('G', 12, SYS_GPG_MFPH_PG12MFP_EBI_AD3)
#define PG12MFP_UART7_RXD NVT_PINMUX('G', 12, SYS_GPG_MFPH_PG12MFP_UART7_RXD)
#define PG13MFP_GPIO NVT_PINMUX('G', 13, SYS_GPG_MFPH_PG13MFP_GPIO)
#define PG13MFP_BPWM0_CH1 NVT_PINMUX('G', 13, SYS_GPG_MFPH_PG13MFP_BPWM0_CH1)
#define PG13MFP_EBI_AD4 NVT_PINMUX('G', 13, SYS_GPG_MFPH_PG13MFP_EBI_AD4)
#define PG13MFP_UART6_TXD NVT_PINMUX('G', 13, SYS_GPG_MFPH_PG13MFP_UART6_TXD)
#define PG14MFP_GPIO NVT_PINMUX('G', 14, SYS_GPG_MFPH_PG14MFP_GPIO)
#define PG14MFP_BPWM0_CH0 NVT_PINMUX('G', 14, SYS_GPG_MFPH_PG14MFP_BPWM0_CH0)
#define PG14MFP_EBI_AD5 NVT_PINMUX('G', 14, SYS_GPG_MFPH_PG14MFP_EBI_AD5)
#define PG14MFP_UART6_RXD NVT_PINMUX('G', 14, SYS_GPG_MFPH_PG14MFP_UART6_RXD)
#define PG15MFP_GPIO NVT_PINMUX('G', 15, SYS_GPG_MFPH_PG15MFP_GPIO)
#define PG15MFP_ADC0_ST NVT_PINMUX('G', 15, SYS_GPG_MFPH_PG15MFP_ADC0_ST)
#define PG15MFP_ADC_ST NVT_PINMUX('G', 15, SYS_GPG_MFPH_PG15MFP_ADC_ST)
#define PG15MFP_CLKO NVT_PINMUX('G', 15, SYS_GPG_MFPH_PG15MFP_CLKO)
#define PH4MFP_GPIO NVT_PINMUX('H', 4, SYS_GPH_MFPL_PH4MFP_GPIO)
#define PH4MFP_EBI_ADR3 NVT_PINMUX('H', 4, SYS_GPH_MFPL_PH4MFP_EBI_ADR3)
#define PH4MFP_UART6_TXD NVT_PINMUX('H', 4, SYS_GPH_MFPL_PH4MFP_UART6_TXD)
#define PH4MFP_UART7_nRTS NVT_PINMUX('H', 4, SYS_GPH_MFPL_PH4MFP_UART7_nRTS)
#define PH5MFP_GPIO NVT_PINMUX('H', 5, SYS_GPH_MFPL_PH5MFP_GPIO)
#define PH5MFP_EBI_ADR2 NVT_PINMUX('H', 5, SYS_GPH_MFPL_PH5MFP_EBI_ADR2)
#define PH5MFP_UART6_RXD NVT_PINMUX('H', 5, SYS_GPH_MFPL_PH5MFP_UART6_RXD)
#define PH5MFP_UART7_nCTS NVT_PINMUX('H', 5, SYS_GPH_MFPL_PH5MFP_UART7_nCTS)
#define PH6MFP_GPIO NVT_PINMUX('H', 6, SYS_GPH_MFPL_PH6MFP_GPIO)
#define PH6MFP_EBI_ADR1 NVT_PINMUX('H', 6, SYS_GPH_MFPL_PH6MFP_EBI_ADR1)
#define PH6MFP_UART7_TXD NVT_PINMUX('H', 6, SYS_GPH_MFPL_PH6MFP_UART7_TXD)
#define PH7MFP_GPIO NVT_PINMUX('H', 7, SYS_GPH_MFPL_PH7MFP_GPIO)
#define PH7MFP_EBI_ADR0 NVT_PINMUX('H', 7, SYS_GPH_MFPL_PH7MFP_EBI_ADR0)
#define PH7MFP_UART7_RXD NVT_PINMUX('H', 7, SYS_GPH_MFPL_PH7MFP_UART7_RXD)
#define PH8MFP_GPIO NVT_PINMUX('H', 8, SYS_GPH_MFPH_PH8MFP_GPIO)
#define PH8MFP_EBI_AD12 NVT_PINMUX('H', 8, SYS_GPH_MFPH_PH8MFP_EBI_AD12)
#define PH8MFP_QSPI0_CLK NVT_PINMUX('H', 8, SYS_GPH_MFPH_PH8MFP_QSPI0_CLK)
#define PH8MFP_UART1_TXD NVT_PINMUX('H', 8, SYS_GPH_MFPH_PH8MFP_UART1_TXD)
#define PH8MFP_UART3_nRTS NVT_PINMUX('H', 8, SYS_GPH_MFPH_PH8MFP_UART3_nRTS)
#define PH9MFP_GPIO NVT_PINMUX('H', 9, SYS_GPH_MFPH_PH9MFP_GPIO)
#define PH9MFP_EBI_AD13 NVT_PINMUX('H', 9, SYS_GPH_MFPH_PH9MFP_EBI_AD13)
#define PH9MFP_QSPI0_SS NVT_PINMUX('H', 9, SYS_GPH_MFPH_PH9MFP_QSPI0_SS)
#define PH9MFP_UART1_RXD NVT_PINMUX('H', 9, SYS_GPH_MFPH_PH9MFP_UART1_RXD)
#define PH9MFP_UART3_nCTS NVT_PINMUX('H', 9, SYS_GPH_MFPH_PH9MFP_UART3_nCTS)
#define PH10MFP_GPIO NVT_PINMUX('H', 10, SYS_GPH_MFPH_PH10MFP_GPIO)
#define PH10MFP_EBI_AD14 NVT_PINMUX('H', 10, SYS_GPH_MFPH_PH10MFP_EBI_AD14)
#define PH10MFP_QSPI0_MISO1 NVT_PINMUX('H', 10, SYS_GPH_MFPH_PH10MFP_QSPI0_MISO1)
#define PH10MFP_UART0_TXD NVT_PINMUX('H', 10, SYS_GPH_MFPH_PH10MFP_UART0_TXD)
#define PH10MFP_UART4_TXD NVT_PINMUX('H', 10, SYS_GPH_MFPH_PH10MFP_UART4_TXD)
#define PH11MFP_GPIO NVT_PINMUX('H', 11, SYS_GPH_MFPH_PH11MFP_GPIO)
#define PH11MFP_EBI_AD15 NVT_PINMUX('H', 11, SYS_GPH_MFPH_PH11MFP_EBI_AD15)
#define PH11MFP_PWM0_CH5 NVT_PINMUX('H', 11, SYS_GPH_MFPH_PH11MFP_PWM0_CH5)
#define PH11MFP_QSPI0_MOSI1 NVT_PINMUX('H', 11, SYS_GPH_MFPH_PH11MFP_QSPI0_MOSI1)
#define PH11MFP_UART0_RXD NVT_PINMUX('H', 11, SYS_GPH_MFPH_PH11MFP_UART0_RXD)
#define PH11MFP_UART4_RXD NVT_PINMUX('H', 11, SYS_GPH_MFPH_PH11MFP_UART4_RXD)
